app/controllers/application_controller.rb

SELECT `counts`.* FROM `counts`
INSERT INTO `counts` (`count`, `refresh_time`, `created_at`, `updated_at`) VALUES (1, '2016-04-18 07:51:16', '2016-04-18 07:51:16', '2016-04-18 07:51:16')
---
  def create
    num = Count.all.length
    Count.create(count:num + 1,refresh_time:Time.now)