app/controllers/chat_controller.rb

  def create
    # App.chat.speak(params)
    puts params.to_json
    Message.create(content:params[:content],name:params[:name])
---
INSERT INTO `messages` (`created_at`, `updated_at`) VALUES ('2016-04-19 09:24:42', '2016-04-19 09:24:42')

  def get_all
    logger.info "xxx"
    logger.info ActionCable.server.channel_classes
    logger.info "xxx"
    json = {
        success:true,
        data: Message.all
---
SELECT `messages`.* FROM `messages`